glennlopez/EmbeddedSystems.Playground/Cypress/PSoC/USER_COMPONENTS/LED_SegDriver/TestBench.cydsn/Generated_Source/PSoC3/CyLib.h
/******************************************************************************
* File Name: CyLib.h
* Version 2.40
*
*  Description:
*
*  Note:
*   Documentation of the API's in this file is located in the
*   System Reference Guide provided with PSoC Creator.
*
********************************************************************************
* Copyright 2008-2011, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(__CYLIB_H__)
#define __CYLIB_H__

#include <string.h>
#include <limits.h>
#include <ctype.h>
#include <cytypes.h>
#include <cyfitter.h>
#include <cydevice_trm.h>
#include <cyPm.h>

#if defined(__C51__)
#include <PSoC3_8051.h>
#endif

/***************************************
* Conditional Compilation Parameters
***************************************/

/***************************************************************
* THESE HAVE BEEN DEPRICATED, BUT LEFT FOR BACKWARDS
* COMPATABILITY. USE #defines FROM cytypes.h FILE.
***************************************************************/

/* PSoC3 ES2 or earlier */
#define CYLIB_PSOC3_ES2    CY_PSOC3_ES2
/* PSoC5 ES1 or earlier */
#define CYLIB_PSOC5_ES1    CY_PSOC5_ES1
/* PSoC3 ES3 or later */
#define CYLIB_PSOC3_ES3    CY_PSOC3_ES3
/* PSoC5 ES2 or later */
#define CYLIB_PSOC5_ES2    CY_PSOC5_ES2

/* CYLIB CLOCK macros/funcs begin*/

/***************************************
*    Function Prototypes
***************************************/
cystatus CyPLL_OUT_Start(uint8 wait) ;
void  CyPLL_OUT_Stop(void) ;
void  CyPLL_OUT_SetPQ(uint8 P, uint8 Q, uint8 current) ;
void  CyPLL_OUT_SetSource(uint8 source) ;

void  CyIMO_Start(uint8 wait) ;
void  CyIMO_Stop(void) ;
void  CyIMO_SetFreq(uint8 freq) ;
void  CyIMO_SetSource(uint8 source) ;
void  CyIMO_EnableDoubler(void) ;
void  CyIMO_DisableDoubler(void) ;

void  CyMasterClk_SetSource(uint8 source) ;
void  CyMasterClk_SetDivider(uint8 divider) ;
void  CyBusClk_SetDivider(uint16 divider) ;
void  CyCpuClk_SetDivider(uint8 divider) ;
void  CyUsbClk_SetSource(uint8 source) ;

void  CyILO_Start1K(void) ;
void  CyILO_Stop1K(void) ;
void  CyILO_Start100K(void) ;
void  CyILO_Stop100K(void) ;
void  CyILO_Enable33K(void) ;
void  CyILO_Disable33K(void) ;
void  CyILO_SetSource(uint8 source) ;
uint8 CyILO_SetPowerMode(uint8 mode) ;

uint8 CyXTAL_32KHZ_ReadStatus(void) ;
uint8 CyXTAL_32KHZ_SetPowerMode(uint8 mode) ;
void  CyXTAL_32KHZ_Start(void) ;
void  CyXTAL_32KHZ_Stop(void) ;

cystatus CyXTAL_Start(uint8 wait) ;
void  CyXTAL_Stop(void) ;
void  CyXTAL_EnableErrStatus(void) ;
void  CyXTAL_DisableErrStatus(void) ;
uint8 CyXTAL_ReadStatus(void) ;
void  CyXTAL_EnableFaultRecovery(void) ;
void  CyXTAL_DisableFaultRecovery(void) ;
void  CyXTAL_SetStartup(uint8 setting) ;

#if CY_PSOC3_ES3
void CyXTAL_SetFbVoltage(uint8 setting) ;
void CyXTAL_SetWdVoltage(uint8 setting) ;
#endif 

/***************************************
*    API Constants
***************************************/
#define PLL_CONTROL_ENABLE             (1 << 0) /* Enables the PLL. */
#define PLL_STATUS_LOCK                (1 << 0) /* Lock Status. */
#define PLL_STATUS_ENABLED             (1 << 0) /* Enabled Status. */
#define IMO_PM_ENABLE                  (1 << 4) /* Enable IMO clock source. */
#define XMHZ_CONTROL_ENABLE            (1 << 0) /* Enables the 4 - 33 MHz crystal oscillator circuit when set high. */

#define X32_CONTROL_ANA_STAT           (1 << 5) /* Indicates oscillator status, using internal analog measurement. */
#define X32_CONTROL_DIG_STAT           (1 << 4) /* Indicates oscillator status, using test against a reference clock. The ILO's CLK33K must be enabled for this function to operate. */
#define X32_CONTROL_LPM                (1 << 1) /* Power setting for 32K crystal oscillator.
                                                This setting only takes effect in sleep modes.
                                                During active modes, the oscillator always runs in high power mode. */
#define X32_CONTROL_LPM_POSITION        1           /* Power setting bits position*/
#define X32_CONTROL_X32EN               (1 << 0) /* 32K Crystal Oscillator Enable. */
#if (CY_PSOC3_ES3 || CY_PSOC5_ES2)
#define X32_CONTROL_PDBEN               (1 << 2)      /* Power switch enable (active-low powerdown) for 32K crystal oscillator. */
#endif
#define X32_TR_CLEAR                    0x00u     /* X32_TR Trim value*/
#define X32_TR_LPMODE                   0x01u     /* X32_TR LP value*/
#define X32_TR_HPMODE                   0x06u     /* X32_TR HP value*/
#define X32_TR_DPMODE                   0x03u     /* X32_TR default value*/
#define X32_TST_SETALL                  0xF3u     /* Test bits, high for normal operation*/
#define X32_CFG_LOWPOWERMODE            (1 << 7) /* Low power oscillator mode configuration. */
#define X32_CONTROL_XERR_DIS            (1 << 2) /* xfb_dis bit in FASTCLK_XMHZ_CSR*/
#define X32_CONTROL_XERR_MASK           (1 << 7) /* High output indicates oscillator failure. */
#define X32_CONTROL_XERR_POSITION       7            /* XERR bits position. */
#define X32_CONTROL_FAULT_RECOVER       (1 << 6) /*      Enable External Crystal Oscillator (XMHZ) fault recovery circuitry*/
#define ILO_CONTROL_PD_MODE             (1 << 4) /* Power down mode for ILO. */
#define X32_CFG_LP_DEFAULT              0x4u     /* Low power default lp bits . */
#define X32_CFG_LP_LOWPOWER             0x8u     /* High power mode, lp bits . */
#define X32_CFG_LP_BITS_MASK            0xCu     /* power bits (lp) mask. */

#define CY_X32_HIGHPOWER_MODE           0    /*High power mode*/
#define CY_X32_LOWPOWER_MODE            1	 /*Low power mode*/

#define CY_XTAL32K_DIG_STAT             (1 << 4)
#define CY_XTAL32K_DIG_STAT_UNSTABLE     0
#define CY_XTAL32K_ANA_STAT             (1 << 5)
#define CY_XTAL32K_ANA_STAT_UNSTABLE    0x0u
#define CY_XTAL32K_STAT_FIELDS          0x30u

